# Ініціалізація телефонної книги
phonebook = {
    "Василь": 978574333,
    "Дмитро": 988300064,
    "Сергій": 677662067,
}

# Використання методу update для додавання нового контакту
phonebook.update({"Артур": 908535053})

# Використання методу pop для видалення контакту
phonebook.pop("Дмитро", None)

# Використання тернарного оператора для перевірки наявності контактів
print("Артур доданий до телефонної книги.") if "Артур" in phonebook else None
print("Дмитро більше не в телефонній книзі.") if "Дмитро" not in phonebook else None

