class Singleton:
    # Класова змінна (спільна для всіх об'єктів класу).
    # Тут зберігається єдиний екземпляр класу.
    _instance = None

    def __new__(cls):
        # __new__ викликається перед __init__ і саме він створює об'єкт у пам'яті.
        # Перевіряємо, чи екземпляр Singleton уже існує.
        if cls._instance is None:
            # Якщо ще не створений — створюємо новий екземпляр через батьківський клас.
            cls._instance = super().__new__(cls)
        # Повертаємо вже створений або новий екземпляр.
        # Таким чином гарантується, що завжди повертається один і той самий об'єкт.
        return cls._instance


# Використання
a = Singleton()  # перша спроба створити екземпляр → буде створено об'єкт
b = Singleton()  # друга спроба → повертається вже той самий об'єкт

# Перевірка
print(a is b)  # True — a і b посилаються на один і той самий екземпляр Singleton

